testdata/IN_2023_02/Roundtrip/produkt/rente/air/20220207_anbieterwechsel_missing_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                      
          <gevo:Vermittler>
                            
            <allg:PartnerID>3445711</allg:PartnerID>
                            
            <allg:Vermittlerrolle>
                                  
              <allg:ArtID>01</allg:ArtID>
                                  
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
                              
            </allg:Vermittlerrolle>
                        
          </gevo:Vermittler>
                      
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                            
            <partner:PartnerID>3445711</partner:PartnerID>
                        
          </tarif:Partner>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <basis:Erweiterung xsi:type="vb-leben:CT_PersonErweiterung"/>
                            
            <partner:Anrede>1</partner:Anrede>
                            
            <partner:PartnerID>22886592</partner:PartnerID>
                            
            <partner:Anschrift>
                                  
              <allg:Landname>Deutschland</allg:Landname>
                                  
              <partner:ArtID>1</partner:ArtID>
                              
            </partner:Anschrift>
                            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                        
          </tarif:Partner>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:PartnerID>14109026</partner:PartnerID>
                            
            <partner:Anschrift>
                                  
              <allg:Landname>Deutschland</allg:Landname>
                                  
              <partner:ArtID>1</partner:ArtID>
                              
            </partner:Anschrift>
                            
            <partner:Partnerbeziehung>
                                  
              <partner:PartnerID>22886592</partner:PartnerID>
                                  
              <partner:Art xsi:type="dt:STE_PartnerbeziehungBasis">01</partner:Art>
                              
            </partner:Partnerbeziehung>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                        
          </tarif:Partner>
                      
          <tarif:Versicherungsnehmer>
                            
            <partner:PartnerID>22886592</partner:PartnerID>
                        
          </tarif:Versicherungsnehmer>
                      
          <tarif:Verkaufsprodukt>
                            
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
                                  
              <vb-leben:Transparente>false</vb-leben:Transparente>
                                  
              <vb-leben:Konsortium>Ohne</vb-leben:Konsortium>
                              
            </basis:Erweiterung>
                            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                  
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                                        
                <vb-leben:Tarifgruppe>Honorar</vb-leben:Tarifgruppe>
                                    
              </basis:Erweiterung>
                                  
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                        
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                    
              </pm:Beitrag>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                        
                <pm:Betrag>
                                              
                  <allg:Betrag>304.18</allg:Betrag>
                                              
                  <allg:Waehrung>EUR</allg:Waehrung>
                                          
                </pm:Betrag>
                                        
                <pm:Zahlungsweise>6</pm:Zahlungsweise>
                                    
              </pm:Beitrag>
                                  
              <pm:Versicherungsdauer>
                                        
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                                    
              </pm:Versicherungsdauer>
                                  
              <pm:Kennung>AIR</pm:Kennung>
                                  
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ZulagenRente">
                                        
                <basis:Erweiterung xsi:type="vb-leben:CT_RenteErweiterung">
                                              
                  <vb-leben:TodesfallleistungImBezug>Restkapital</vb-leben:TodesfallleistungImBezug>
                                              
                  <vb-leben:IndexDaten>
                                                    
                    <vb-leben:VorgabeartIndexbeteiligung>ChanceBalance</vb-leben:VorgabeartIndexbeteiligung>
                                                    
                    <vb-leben:Index>DAX</vb-leben:Index>
                                                
                  </vb-leben:IndexDaten>
                                          
                </basis:Erweiterung>
                                        
                <pm:Beitrag>
                                              
                  <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                              
                  <pm:Betrag>
                                                    
                    <allg:Betrag>152.09</allg:Betrag>
                                                    
                    <allg:Waehrung>EUR</allg:Waehrung>
                                                
                  </pm:Betrag>
                                              
                  <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                          
                </pm:Beitrag>
                                        
                <pm:Versicherungsdauer>
                                              
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                                              
                  <allg:AnzahlMonate>10</allg:AnzahlMonate>
                                          
                </pm:Versicherungsdauer>
                                        
                <pm:Dynamik>
                                              
                  <basis:Erweiterung xsi:type="vb-leben:CT_DynamikErweiterung">
                                                    
                    <vb-leben:Art>TodesUndErlebensfall</vb-leben:Art>
                                                
                  </basis:Erweiterung>
                                              
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">05</pm:ArtID>
                                              
                  <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                              
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                                          
                </pm:Dynamik>
                                        
                <vs-pm:VersicherungssummeOderLeistung>
                                              
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                              
                  <vs-pm:Wertschluessel xsi:type="vb-leben:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                              
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                              
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                              
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                          
                </vs-pm:VersicherungssummeOderLeistung>
                                        
                <vs-pm:Bezugsrecht>
                                              
                  <vs-pm:Leistungsfall>Erlebensfall</vs-pm:Leistungsfall>
                                              
                  <vs-pm:IndexBerechtigter>1</vs-pm:IndexBerechtigter>
                                          
                </vs-pm:Bezugsrecht>
                                        
                <vs-pm:Bezugsrecht>
                                              
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                                              
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                                          
                </vs-pm:Bezugsrecht>
                                        
                <pm-leben:Hochrechnungszins>3</pm-leben:Hochrechnungszins>
                                        
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                        
                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">14</pm-leben:UeberschussverwendungNachLeistung>
                                        
                <pm-leben:VersichertePerson>
                                              
                  <partner:PartnerID>22886592</partner:PartnerID>
                                          
                </pm-leben:VersichertePerson>
                                        
                <pm-leben:ZulagenDaten>
                                              
                  <basis:Erweiterung xsi:type="vb-leben:CT_ZulagenDatenErweiterung">
                                                    
                    <vb-leben:AltersvorsorgewirksameLeistungen>false</vb-leben:AltersvorsorgewirksameLeistungen>
                                                    
                    <vb-leben:Familienstand>OhneNichtSelbstBerechtigtenPartner</vb-leben:Familienstand>
                                                    
                    <vb-leben:Antragsdaten>
                                                          
                      <vb-leben:BesondererPersonenkreis>false</vb-leben:BesondererPersonenkreis>
                                                          
                      <vb-leben:AuslaendischeBeschaeftigung>false</vb-leben:AuslaendischeBeschaeftigung>
                                                          
                      <vb-leben:OhneDauerzulagenantrag>false</vb-leben:OhneDauerzulagenantrag>
                                                      
                    </vb-leben:Antragsdaten>
                                                
                  </basis:Erweiterung>
                                              
                  <pm-leben:Foerderungsberechtigung>selbst</pm-leben:Foerderungsberechtigung>
                                              
                  <pm-leben:EinkommenVorjahr>50000</pm-leben:EinkommenVorjahr>
                                              
                  <pm-leben:Eigenbeitragsart>min</pm-leben:Eigenbeitragsart>
                                          
                </pm-leben:ZulagenDaten>
                                    
              </pm:Elementarprodukt>
                                  
              <pm-leben:VorgabeBerechnung>
                                        
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                        
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">ZulagenRente</pm-leben:Kontext>
                                    
              </pm-leben:VorgabeBerechnung>
                              
            </pm:Produkt>
                        
          </tarif:Verkaufsprodukt>
                  
        </tarif:Tarifierung>
            
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
